Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: མིག་སྨན་དང་། མིག་བསྐུ་བ་དང་། ཐིག་ལེར་བྱས་པ་དང་བཅས་པས་ཀུན་ལེགས་པར་བསྐུས་ལ། པདྨའི་སྡོང་བུའི་བར་དུ་ནོར་བུ་རིན་པོ་ཆེ་བཞག་ནས་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱ། ཁྲོ་བོའི་རྒྱལ་པོས་ལན་བདུན་གྱི་བར་དུ་དབང་བསྐུར་ནས་རིག་སྔགས་འཆང་གཙང་མ་ལེགས་པར་ཁྲུས་བྱས་ལ།
en: The vidyā holder should smear them with the king of oils, apply the lotus powder, eye ointment, and bindi, and place a single jewel inside the lotus’ stalk He should incant the lotus with the Amogharāja one thousand and eight times and consecrate it by reciting the Krodharāja seven times. “

source: གོས་གཙང་མ་བགོས་པས་ཏིལ་མར་གྱིས་བདག་ཉིད་ལ་བསྐུ་བར་བྱ།
en: He should maintain ritual purity, bathe thoroughly, and wear clean clothes.

source: མིག་བསྐུ་བ་དང་། ཐིག་ལེ་དང་། བདུག་པས་བདག་ཉིད་ཀྱི་ལུས་ལ་བདུག་པར་བྱའོ།
en: He should then smear his entire body with the same oil, apply the eye ointment and bindi, and fumigate his body with incense.

source: །ལག་པ་གཡས་པ་ལ་ནོར་བུ་གདགས། ལག་པ་གཡོན་པ་པདྨ་གཟུང་ལ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ། འཁོར་གྱི་ནང་དུ་བཅོམ་ལྡན་འདས་ལ་པདྨའི་མཆོད་པ་འབུམ་བྱ་སྟེ།
en: Standing before the image of the Blessed One in the midst of the assembly and holding a jewel in his right hand and a lotus in his left, he should offer the lotus to the Blessed One a hundred thousand times.

source: པདྨ་འབུམ་འབྱུང་བར་འགྱུར་རོ།
en: When the offering procedure is completed, one hundred thousand lotuses will appear.

source: །མཆོད་པའི་ཆོ་ག་བྱས་ནས་ཆུ་དང་ཡུངས་ཀར་གྱིས་བཏབ་ན་ཡང་འབྱུང་བར་འགྱུར་རོ།
en: If the vidyā holder casts mustard seeds and water on them, they will no longer be seen. “

source: །པདྨ་སྤྲུལ་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཆུའི་ནང་དུ་བོར་ན་པདྨ་མགལ་མེ་བསྐོར་བ་ལྟར་འཁོར་བར་འགྱུར་ལ། པདྨ་འབུམ་རྣམས་ཆར་དུ་འབབ་པར་འགྱུར་རོ། །པདྨའི་ཆུའི་ནང་དུ་གཞག་པར་བྱ་བ་ནི་མཚོ་བྲན་ནམ། ལྟེང་ཀའམ། ཆུ་བོའམ།
en: If the magically created lotuses are left in water, they will spin like a revolving firebrand, and a rain of one hundred thousand lotuses will fall.

source: ཆུ་བོ་ཆེན་པོའམ། འོབས་སམ། རྫིང་ངམ། མཚོའི་ནང་གང་ཡང་རུང་བའི་གནས་སུ་བཞག་ན་གནས་དེ་དང་དེ་ཐམས་ཅད་དུ་པདྨའི་མཚོ་ཆེན་པོ་འབྱུང་སྟེ།
en: If the vidyā holder places a single lotus in a body of water, such as a pond, tank, rivulet, river, trench, lotus pond, or lake, they will be filled with great numbers of lotuses.

source: ཇི་སྲིད་དུ་པདྨ་མ་ཕྱུང་བ་དེ་སྲིད་དུ། དུས་རྟག་ཏུ་པདྨའི་མཚོར་འདུག་སྟེ།
en: The clusters of lotuses will remain there until the vidyā holder takes the original lotus out of the water.

source: སྟོན་ཀའམ། དགུན་ནམ། དཔྱིད་དམ། སོས་ཀ་ཚ་བའི་དུས་སུ་རྟག་ཏུ་པདྨའི་མཚོར་འདུག་གོ།
en: The lotuses will remain there throughout the autumn, winter, spring, and summer. “

source: །ཚལ་གྱི་འགྲམ་དུ་ཞུགས་ནས་ཡུངས་ཀར་ལ་ཏིལ་མར་གྱིས་བསྐུས་པ་ཕྱེ་མ་དང་སྦྱར་ནས་མེ་ཏོག་གང་ཡང་རུང་བ་ཞིག་ལག་གིས་བཟུང་སྟེ་བསྐོར་ལ་ཡུངས་ཀར་གྱིས་གཏོར་ན།
en: Equipped with mustard seeds daubed in the oil and mixed with the powder, the vidyā holder should enter a forest and pick any flower he likes. He should twirl the flower and cast the mustard seeds near the edge of the forest.

source: ཚལ་གྱི་མཐའི་ཤིང་ཐམས་ཅད་ལ་མེ་ཏོག་རྒྱས་པར་སྣང་ངོ་།
en: All the trees will then burst into blossom, and all the flowers will bloom.

source: །དགེ་འདུན་གྱི་ནང་ངམ། ཚོགས་པའི་ནང་ངམ། རྒྱལ་པོའི་ཕ་བྲང་འཁོར་རམ། སྐྱེ་བོའི་ནང་དུ་མེ་ཏོག་ཇི་སྙེད་པ་ལག་གིས་བསྐོར་ལ། ཡུངས་ཀར་གྱིས་གཏོར་ན་མེ་ཏོག་མང་པོ་འབྱུང་བར་འགྱུར་རོ།
en: If he twirls the flower in his hand and casts the mustard seeds in the midst of an assembly of monks, a royal household, or any place where people gather, a great rain of flowers will fall.

source: །ཆུ་དང་ཡུངས་ཀར་གྱིས་ཐམས་ཅད་དུ་ཟློག་པར་བྱེད་པ་ཡིན་ནོ།
en: He should always use the mustard seeds with water as the counteragent. “

source: །འབྲས་བུ་ཇི་སྙེད་པ་ལག་གིས་བཟུང་ནས་ཡུང་ཀར་གྱིས་གཏོར་ན་འབྲང་བུའི་ཆར་འབབ་པར་འགྱུར་རོ།
en: If the vidyā holder takes a fruit in his hand and casts the mustard seeds, a rain of fruit will fall.

source: །གོས་ལག་པས་བཟུང་ནས་ཡུངས་ཀར་གྱིས་གཏོར་ཏེ་བསྐོར་ན་གོས་དང་བླ་རེ་སྣ་ཚོགས་སྟོན་པར་བྱེད་དོ།
en: If he takes a piece of cloth in his hand and casts the mustard seeds while waving the cloth, he will magically produce various fabrics and canopies.

source: །རྒྱན་ལག་པས་བཟུང་ནས་ཡུངས་ཀར་གྱིས་གཏོར་ན། །ལྷའི་རྒྱན་བཟང་པོ་སྣ་ཚོགས་པ་ལག་ཏུ་འབྱུང་བར་འགྱུར་ཞིང་སྐྱེ་བོ་འདུས་པ་ཐམས་ཅད་ཀྱི་རྒྱུན་དུ་བྱེད་ལ་ཐམས་ཅད་ལ་རྒྱན་བཏགས་པར་འགྱུར་རོ།
en: If he takes an ornament in his hand and casts the mustard seeds, he will produce various divine structures and ornaments from his hand. He will adorn everyone that gathers around him, so that they all have ornaments fastened to them.

source: །ཡུངས་ཀར་དང་ཆུས་བཟློག་པར་བྱའོ།
en: The counteragent for this is mustard seeds with water. “

source: ཡུངས་ཀར་ལ་ཏིལ་མར་གྱིས་བསྐུས་ཕྱེ་མས་བསྒོ། །གིའུ་ཝང་དང་། གུར་གུམ་དང་། ཤིང་ཀུན་དང་། སྣུ་ཧའི་འོ་མས་ཀྱང་བསྒོས་ལ་དེ་དག་གཅིག་ཏུ་བྱས་ནས་གྲིབ་མ་ལ་བསྐམ་མོ།
en: The vidyā holder should daub some mustard seeds in the oil, mix them with the powder, add bovine bezoar, saffron, and vermilion, and blend everything with the sap of common milk hedge until the mixture is homogenous.

source: །དེ་ནས་འབྲས་བུ་གཅིག་ཁར་བཅུག་ལ་ཕྱོགས་བཞིར་གཏོར་ན་ཁ་ནས་མེ་འབར་བར་སྣང་ཞིང་ལུས་ལས་འབར་བ་སྣ་ཚོགས་འབྱུང་བར་སྣང་སྟེ།
en: He should then leave the mixture in the shade until it is completely dry. He should place the product in his mouth and scatter it in the four directions. His face will glow like fire, and his body will blaze with light of various colors.

source: ཇི་སྲིད་དུ་ཡུངས་ཀར་ཁ་ན་ཡོད་པའི་བར་དུ་ལུས་ལས་འོད་ཟེར་འབར་བ་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་འབྱུང་ངོ་།
en: The bright multicolored light will continue to shine forth for as long as the mustard seeds remain in the mouth. “

source: །ཏིལ་མར་དང་ལྷན་ཅིག་བཏགས་པའི་སྙིང་པོར་བྱ།
en: The vidyā holder should grind some sickle senna with the oil and make a wick for a lamp.

source: ཀོང་བུར་ཏིལ་མར་གྱི་རྒྱལ་པོས་བཀང་སྟེ་མར་མེ་འབུམ་སྟོན་པར་བྱེད་དོ།
en: If he then fills a lamp with the king of oils and lights it, one hundred thousand lighted lamps will appear.

source: །མེ་ཐབ་ཁང་བུའི་ནང་དུ་བཅུག་ན་ཇི་སྲིད་དུ་མ་ཕྱུང་བ་དེ་སྲིད་དུ་མ་ཕྱུང་བ་དེ་སྲིད་དུ་མེ་འབར་བར་སྟོན་ཏོ།
en: If he places the lamp in the center of a fire pit, the flame of the lamp will blaze until he removes it.

source: །མར་མེའི་སྡོང་བུའི་ནང་དུ་བཅུག་ལ་མ་ཕྱུང་ན་རྟག་ཏུ་འབར་རོ།
en: If he places the lamp in the hollow of a tree, the lamp will burn continuously until he removes it.

source: །མགལ་མེ་འབར་བའི་ནང་དུ་བཅུག་ན་འབར་བའི་ཕྲེང་བ་འབུམ་སྙེད་དུ་སྣང་ངོ་།
en: If he places the lamp between firebrands, it will appear as a blazing row of one hundred thousand lamps. “

source: །གཏོར་མའི་རྫ་མ་དང་། བུམ་པའི་ནང་དུ་གཏོར་ན་གཏོར་མའི་རྫ་མ་དང་། བུམ་པ་ཐམས་ཅད་འབར་བར་སྣང་ངོ་།
en: If the vidyā holder sprinkles the inside of a jar or a pitcher used for a bali offering, all the jars and pitchers will appear radiant with light.

source: །ལག་ཆ་དང་། མཚོན་ཆ་ཐམས་ཅད་ལ་བྱུགས་ན་གཅིག་ཏུ་འབར་བར་འགྱུར་རོ།
en: If he smears all war implements and sharp weapons, they will appear as a single blaze of light.

source: །བདག་ཉིད་ཀྱི་ལུས་ལ་བྱུགས་ལ་རིལ་བུ་གཙང་མ་སྤྱི་བོར་བཞག་ན་ལུས་ཐམས་ཅད་གཅིག་ཏུ་འབར་བར་སྣང་བ་ནས་ལུས་རིལ་བསྲེགས་པ་ལྟར་སྣང་ངོ་། །འོ་མ་དང་ཡུངས་ཀར་གྱིས་གཏོར་ན་ལུས་སླར་སྣང་བར་འགྱུར་རོ། །ལག་པ་དང་རྐང་པ་ལ་བསྐུས་ལ། རིལ་བུ་གཙང་མ་འབར་བ་ལག་པ་གཡས་པས་གཟུང་བའམ།
en: If he smears his body and places the secret wick on his head, his entire body will appear as if aflame, and it will blaze until the vidyā holder sprinkles it with the mustard seeds and milk, at which point it will appear normal again.

source: །རྐང་པའི་མཐེ་བོས་བཟུང་ན་ལག་པ་དང་། །རྐང་པ་གཅིག་པུ་འབར་བ་དང་། འབྲེལ་བར་སྣང་ངོ་། །འདུས་པའི་ནང་ངམ།
en: If he smears his hands and feet and takes the lighted secret wick into his hand, his hands and feet will appear engulfed in a single blaze of light.

source: སྐྱེ་བོ་འདུས་པ་མང་པོའམ། རྒྱལ་པོའི་འཁོར་རམ། སྡེ་ཅན་གྱི་ནང་ངམ། རིག་བྱེད་བཞིའི་ནང་ཐམས་ཅད་དུ་ཡན་ལག་ཉམས་པར་སྣང་ངོ་།
en: He will appear without limbs in a meeting, a large crowd of people, a royal household, or a group of learned men, or among brahmins conversant with the four Vedas.

source: །དྲི་ཆབ་དང་། ཡུངས་ཀར་གྱིས་གཏོར་ན་ལུས་སླར་རྫོགས་པར་འགྱུར་རོ།
en: His body will appear complete again after he sprinkles it with the mustard seeds mixed with perfumed water. “

source: །མཚན་མོ་མར་མེའི་རིལ་བུ་བསྲེགས་པ་ལམ་གྱི་བཞི་མདོར་བཞག་ནས་ཡུངས་ཀར་གྱིས་ཕྱོགས་བཞིར་གཏོར་ན་མར་མེ་འབུམ་ཕྲག་བྱེ་བ་སྣང་ངོ་།
en: If he lights the wick at night, places it at a crossroads, and casts the mustard seeds equally in each of the four directions, hundreds of thousands of millions of lamps will appear clearly.

source: །ཀུན་ནས་ཕྱོགས་བཞིར་ཆུ་དང་ཡུངས་ཀར་གྱིས་བཟློག་པར་བྱ་བ་ཡིན་ནོ། །ཚལ་ཆེན་པོའི་མཐའ་དང་།
en: As a counteragent, he should cast the mustard seeds mixed with water everywhere in the four directions.

source: ནང་དུ་གཏོར་ལ་ཤིང་གཅིག་ལ་རིལ་བུ་གཙང་མ་བཞག་ན་ཤིང་དང་། རྩྭ་དང་། ཤིང་གེལ་པ་དང་། འདབ་མ་དང་། ལོ་མ་ཐམས་ཅད་གཅིག་ཏུ་འབར་བར་སྣང་ངོ་།
en: If he sprinkles them within a large forest and places the secret wick by a single tree, all the trees, grasses, and bushes—the branches and the sprouts—will appear to be engulfed in a single blaze. “

source: །རིའི་རྩེ་མོར་མར་མེ་བུས་ནས་རི་ཀུན་ཏུ་གཏོར་ན་རི་ཀུན་ནས་གཅིག་ཏུ་འབར་ཞིང་མཆེད་པར་སྣང་ལ་སེམས་ཅན་ཐམས་ཅད་ཀུན་ནས་ངོ་མཚར་དུ་འཛིན་པར་འགྱུར་རོ། །རྐུན་མ་དང་། གཡོན་ཅན་དང་། གནོད་བྱེད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་།
en: If he lights the lamp on a mountaintop and sprinkles the mountain in all directions, the surrounding mountains will appear to be engulfed in a single blaze, to the amazement of all beings.

source: སྡང་བ་དང་། ཕྱིར་རྒོལ་བ་དང་། ཕས་ཀྱི་དགྲ་ཐམས་ཅད་དང་། སྡང་སེམས་ཅན་ནས་རི་དགས་གཏུམ་པོ་དང་། བྱ་ལ་སོགས་པའི་བར་རིལ་གནས་པ་རྣམས་དེའི་མཚན་མོ་ཉིད་ཕྱོགས་བཅུ་ཀུན་དུ་བྲོས་ཤིང་ཧ་ཧ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་ཏོ།
en: All thieves, rogues, bandits, enemy armies, wicked opponents, and adversaries—all the wicked beings including the wild animals, birds, and so forth who live in those mountains—will flee that very night in the ten directions, uttering cries of woe.

source: །སྤོས་ཆབ་ཀྱིས་བཟློག་པར་འགྱུར་རོ།
en: As a counteragent for this, the vidyā holder should use perfumed water.

source: །གཟུགས་བརྙན་གྱི་སྟེང་དུ་གཏོར་ལ། གཙང་མའི་རིལ་བུ་འབར་བར་བཞག་ན་གཟུགས་བརྙན་ཐམས་ཅད་གཅིག་ཏུ་འབར་བར་འགྱུར་ཏེ།
en: If he casts the substance upon an image and places the lighted secret wick in front of it, all the images will appear to blaze with a single blaze of light.

source: སྤོས་ཆུ་དང་། ཡུངས་ཀར་གྱིས་བཟློག་པར་འགྱུར་རོ།
en: As a counteragent, he should use mustard seeds mixed with perfumed water. “

source: །མར་མེའི་རིལ་བུ་གྲོང་ཁྱེར་གྱི་ཤར་ཕྱོགས་ཀྱི་སྤོར་སྤར་ཏེ་གནས་གཙང་མར་གཞག་དཀྱིལ་འཁོར་གཅིག་བྱས་ནས་གཏོར་མའི་ཆོ་ག་བུམ་པ་བཀང་བ་གཞག།
en: The vidyā holder should place the lamp at the eastern gate of a city and light it. He should place it in a maṇḍala in a clean place and arrange full jars following the procedure for the bali offering.

source: གྲོང་ཁྱེར་ཀུན་ཏུ་ཡུངས་ཀར་གྱིས་གཏོར་ཞིང་དོན་ཡོད་པའི་རྒྱལ་པོ་ཡང་དྲན་པར་བྱས་ན་གྲོང་ཁྱེར་ཀུན་ནས་མར་མེའི་ཕྲེང་བ་འབར་བ་གཅིག་ཏུ་སྣང་ངོ་།
en: He should cast the mustard seeds all around the city while displaying the mudrā of Amogharāja and mindfully reciting the Amogharāja mantra. Subsequently, a row of lighted lamps will appear all around the city, burning with an identical flame.

source: །གྲོང་ཁྱེར་གྱི་སྒོ་བཞིར་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་བྱས་ལ་ཤར་ཕྱོགས་ཀྱི་སྒོ་ནས་ཞུགས་ན་གང་གྲོང་ཁྱེར་ན་གནས་པ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དེ་དག་ཐམས་ཅད་དགའ་བ་ཆེན་པོ་རྒྱ་ཆེ་བས་ཚིམ་པར་འགྱུར་རོ།
en: If he performs the same maṇḍala procedure at each of the four city gates and enters the city through the eastern gate, all the inhabitants of that city—women, men, boys, and girls—will be filled with intense affection and joy.

source: །གྲོང་ཁྱེར་དེ་ན་གང་སྡང་བའི་སེམས་ཅན་ཕྱིར་རྒོལ་བ་དང་། ཕས་ཀྱི་དགྲ་དང་། ཆོམ་རྐུན་དང་། གཡོན་ཅན་དང་། གནོད་བྱེད་དང་། གླགས་ཚོལ་བར་གྱུར་པ། གནོད་སྦྱིན་དང་།
en: Any bad people who are in that city, any opponents, adversaries, thieves, rogues, and bandits, any beings who look for and await an opportunity to cause harm, any bhūtas, yakṣas, rākṣasas, pretas, piśācas, and apasmāras, and any nonhuman beings who dwell in that city, will become perplexed and tormented.

source: སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། བརྗེད་བྱེད་དང་། མི་མ་ཡིན་པ་གང་ཡང་རུང་བ་གྲོང་ཁྱེར་དེ་ན་གནས་པ་དེ་དག་ལང་ལོང་དུ་གྱུར་ཅིང་གདུགས་ལ་ངུ་ཞིང་ཧ་ཧ་ཞེས་སྒྲ་འབྱིན་ཅིང་གྲོང་ཁྱེར་གྱི་སྒོར་བྱུང་ནས་ཕྱོགས་བཅུར་རབ་ཏུ་འབྲོས་སོ།
en: Howling and uttering cries of woe, they will leave the city through its gates and flee in the ten directions.

source: །གྲོང་ཁྱེར་དེ་ཡང་ཀུན་ནས་གནོད་པ་མེད་ཅིང་འཁྲུགས་པ་མེད་པར་འགྱུར། འཇིགས་པ་དང་། གནོད་པ་དང་། ནད་འགོ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་དང་། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར།
en: The city and its environs will become free from all misfortunes and calamities, and all dangers, misfortunes, calamities, accidents, and diseases will be pacified.

source: མཚན་མོ་འདས་ནས་སྤོས་ཆུ་དང་། ཡུངས་ཀར་གྱིས་གྲོང་ཁྱེར་གྱི་སྒོར་གཏོར་ཞིང་དབང་བསྐུར་ན་བཟློག་པར་འགྱུར་རོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་བཅུ་དགུ་པ།
en: If the vidyā holder casts the mustard seeds mixed with perfumed water at the city gates when the night is through, it will serve as the counteragent. “

source: ལྡོང་རོས་དང་། ཐིང་ཤུན་གྱི་ཕྱེ་མ་དང་། ཡུངས་ཀར་དང་། མ་ཧཱ་ཏཻ་ལ་དང་། ཨ་རྐའི་འོ་མ་དང་། ཕ་གུའི་འོ་མ་དང་།
en: The vidyā holder should procure mustard seeds, great oil, realgar, powdered rājapaṭṭa stone, the sap of giant milkweed, and the sap of phāggu and grind them all into a homogenous fine powder together with the eyes and bile of a house lizard, nāgapuṣpa, and lotus stalks.

source: གཅིག་ཏུ་སྦྱར་རོ། །ཉའི་མིག་མཁྲིས་པ་དང་བཅས་པ་དང་། ནཱ་ག་པུས་པ་དང་། པདྨའི་ཆུ་བ་རྣམས་ཀྱང་ལྷན་ཅིག་ཏུ་ཕྱེ་མ་ཞིབ་མོར་བྱའོ། །ཕྱེ་མ་སྔ་མ་ལེགས་པར་སྦྱར་ལ་ཆུས་རིལ་བུར་བྱས་པ་དང་།
en: He should combine this with the powder prepared earlier and make a pill by adding water.

source: ཕྱེ་མས་གཞན་ཡང་བཅང་ངོ་། །ཕྱེ་མས་འདི་དང་པདྨ་ཆེན་པོའི་ཕྱེ་མ་བཅང་བ་ལྷན་ཅིག་ཏུ་བསྲེས་པའི་ཕྱེ་མས་ལུས་བསྐུས་ལ་ཕྱོགས་བཞིར་ཡུངས་ཀར་གཏོར་ཏེ།
en: He should also wear another powder, blending homogenously this powder with the great powder made from lotuses. He should smear his body with the mixed powder and cast mustard seeds in the four directions.

source: རིལ་བུ་ཁར་བཅུག་ལ་ཧཱུྃ་ཞེས་བྱ་བ་བསྡམས་ཏེ་བརྗོད་ན་དེའི་ལུས་ལས་ཆུ་འཛག་ཅིང་། དེ་ཁོ་ན་བཞིན་དུ་རྣ་བ་གཉིས་ཀྱང་ལྷ་རྫས་ཀྱི་ཆུ་འབྱུང་བར་སྣང་།
en: If he holds the pill in his mouth and pronounces the syllable hūṁ while squeezing the pill, water will flow from his body, including his ears.

source: ལུས་ལས་སྤོས་ཀྱི་རིགས་ཡིད་དུ་འོང་བ་རབ་ཏུ་སིམ་པར་བྱེད་པ་འབྱུང་བ་ནི་ནད་ཐམས་ཅད་གྲུབ་པར་སྣང་སྟེ།
en: His body will produce divine water that has a pleasant scent, is refreshing, and brings every kind of success and victory. “

source: རྒྱལ་བའི་ཕྱག་བཞིན་ནོ། །ཡུངས་ཀར་གྱི་ཕྱེ་མ་བླངས་ཏེ་ནམ་མཁའ་ལ་གཏོར་ལ་རིལ་བུ་ལག་པས་བསྐོར་ན་ཆར་ཆེན་པོ་འབབ་པར་འགྱུར་རོ།
en: If the vidyā holder secretly casts the mustard seeds mixed with the powder into the air while rolling the pill in his hand, a great rain will fall.

source: །རིལ་བུ་ནམ་མཁའ་ལ་འཕངས་ན་མི་འབབ་བོ།
en: If he throws the pill into the air, the rain will stop.

source: །གཡུལ་ཆེན་པོ་འགྱེད་པའི་ནང་དུ་ཕྱེ་མ་དེ་ཡུངས་ཀར་དང་བསྲེས་ཏེ་ནམ་མཁའ་ལ་གཏོར་ལ་རིལ་བུ་དེ་ཡང་ཁར་བཅུག་སྟེ། སྟེང་དུ་བལྟས་ལ་ཧཱུྃ་ཞེས་བྱ་བའི་སྒྲས་བོས་ལ། གནམ་ལྕགས་ཆེན་པོ་འབབ་སྟེ་ཡིད་མི་འཆད་པ་དང་སྡུག་བསྔལ་བསྐྱེད་པར་འགྱུར་རོ།
en: If, in the midst of a great battle or war, he casts the powder mixed with the mustard seeds toward the sky while holding the pill in his mouth, turning his face upward, and pronouncing the syllable hūṁ, he will produce a powerful bolt of lightning that brings ruin and downfall. “

source: །ཆུའི་ནང་དུ་ཞུགས་ཏེ་ཕྱེ་མ་དེ་གཏོར་ལ་ཡུངས་ཀར་དང་།
en: The vidyā holder should descend into water and sprinkle the powder mixed with mustard seeds.

source: རིལ་བུ་ཆུའི་ནང་དུ་གདབ་པར་བྱ། ཕྱོགས་བཞིར་ཡུངས་ཀར་གཏོར་ཏེ།
en: He should throw the pill into the water and cast the mustard seeds in the four directions.

source: ཏཻ་ལས་ལུས་ལ་བསྐུས་ན་ཀླུ་ཆེན་པོའི་གཟུགས་སུ་སྣང་ངོ་།
en: If he then rubs his body with the oil, he will appear in the form of a great nāga.

source: །རིལ་བུ་དང་ཡུངས་ཀར་མེའི་མདོག་ལྟ་བུ་ཆུ་དང་བསྲེས་པའི་ཡུངས་ཀར་ནམ་མཁའ་ལ་གཏོར་ན་འབྲུག་སྒྲ་ཆེན་པོ་འབྱུང་ཞིང་གློག་ཆེན་པོ་གསལ་བ་སྣང་བར་འགྱུར་རོ།
en: If he throws the pill into the air together with mustard seeds mixed with water, the seeds will assume the color of fire, a loud rumble of Rāvaṇa will be heard, and powerful bursts of lightning will flash in the sky.

source: །ཆུའི་ནང་ནས་བྱུང་ན་མི་སྣང་བར་འགྱུར་རོ།
en: Once the vidyā holder comes out of the water, these phenomena will no longer be visible.

source: །ཁྲོན་པའི་ནང་དུ་བཏབ་ན་ཆུ་ལུད་ནས་ཕྱོགས་ཀུན་ཏུ་ཆུ་འབབ་པར་འགྱུར་རོ། །རྫ་མའམ། བུམ་པའམ། རྫེའུའམ།
en: If he throws the pill upward at the center of a well, the water in the well will flow upward and overflow in all directions. “

source: རིལ་བ་བྷྲྀངྒ་རའམ།
en: The vidyā holder should smear a jar, pot, small pot, golden pitcher, or water vessel with the powder, cast mustard seeds inside it, and fill it with water.

source: རིལ་བ་ལ་ཕྱེ་མས་བྱུགས་ཏེ། དེའི་སྟེང་དུ་ཡུངས་ཀར་གྱིས་གཏོར་ན་ཆུས་བཀང་སྟེ་ཁྲུས་བྱས་ན་དེ་ཆུ་འབབ་པར་སྣང་ཞིང་དེའི་སྣོད་ནི་མི་སྣང་བར་འགྱུར་རོ།
en: If he subsequently uses this water for ablutions, the water will be seen flowing, but the vessel will be invisible.

source: །གཞན་ཡང་དགོས་པ་མང་པོ་བྱེད་དེ་མཆོག་ཏུ་གྲུབ་པ་ཡིན་ནོ།
en: He will be able to perform many other tasks with great success. “

source: །དེ་ནས་རིན་པོ་ཆེའི་ཆེད་དུ་འབྲུ་མར་གྱི་རྒྱལ་པོ་བྱས་ཏེ་འབྲུ་མར་གཞན་དང་།
en: The king of oils can be applied to large rocks, and the other oils to stones.

source: དེ་བཞིན་དུ་ཏིལ་ལས་འབྲུ་མར་གྱི་རྒྱལ་པོ་དེ་བཞིན་དུ་སྦྱར་རོ།
en: By applying the king of oils, the vidyā holder will leave an impression wherever he places his hands or feet.

source: །ལག་པ་དང་རྐང་པ་བཞག་ལ་འདིར་ཉམ་དྲོད་ཀྱང་ཤེས་པར་བྱའོ།
en: He will leave such impressions anywhere.

source: །གཞག་པ་ཐམས་ཅད་ཉམ་དྲོད་ཤེས་པར་བྱ་བ་ནི་མར་སར་བཞིན་དུ་འཇམ་པར་འགྱུར་ཞིང་སྐད་ཅིག་དེ་ཉིད་ལ་མཐོ་བ་དང་།
en: The rock will become as soft as a freshly churned butter and will instantly give way and bend.

source: དམའ་བ་ཇི་ལྟར་ཡིད་ལ་འདོད་པ་བཞིན་དུ་རི་ཡང་འགྱུར་རོ།
en: It will assume whatever shape the vidyā holder has in mind.

source: །སྙིང་པོ་ཐུར་མ་འདྲ་བ་དང་། ཟླུམ་པོ་འམ། ཡང་ན་ལྕུག་མ་ལྟ་བུར་བྱས་པས་ཀ་བ་ཡང་འདུད་པ་དང་།
en: He can make it round like a wheel or, for that matter, assume the shape of a vine.

source: རི་ཡང་དམའ་བའམ། ཡང་ན་མཐོན་པོར་འགྱུར་བར་བྱེད་དོ།
en: He can make stone pillars bend by themselves and then straighten again. “

source: །ཡུངས་ཀར་དང་པདྨ་ཆེན་པོའི་ཕྱེ་མ་ལྷན་ཅིག་བསྲེས་པ་འབྲུ་མར་གྱི་རྒྱལ་པོས་བསྒོས་པ་ཕྱོགས་བཞིར་ཀུན་ཏུ་གཏོར་ན་རི་ཐམས་ཅད་མི་སྣང་ཞིང་འབྲོག་དགོན་པར་སྣང་བར་འགྱུར་རོ།
en: The vidyā holder should mix mustard seeds together with the great powder made from lotuses and infuse them with the king of oils. If he then casts the seeds throughout the four directions, all mountains will disappear from view.

source: །ཡང་རི་བོར་སྣང་བར་འགྱུར་རོ།
en: He can make them appear as a forest, and then as mountains again.

source: །ཡང་ན་མི་བགྲོད་པར་མི་ནུས་པའི་རིའི་རྩེ་མོ་ན་སེང་གེ་དང་། སྟག་གིས་གང་བ་ལྕུག་མ་དང་ཚེར་མ་ཅན་གྱི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་ཀྱིས་གང་བའམ། རྩུབ་པའམ། དུབ་བུའམ་ཁོང་སྟོང་དུ་སྣང་བར་འགྱུར་རོ།
en: He can populate mountaintops that no human can traverse with lions, tigers, various gramineous plants, vines, trees, and wild plants with jointed and hollow stalks. “

source: །ཅི་སྟེ་རིག་སྔགས་འཆང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཕོ་བྲང་རི་པོ་ཊ་ལའི་གཞལ་མེད་ཁང་མཐོང་བར་འདོད་ན་དེ་ནས་རིག་སྔགས་འཆང་གིས་ཞག་བདུན་གྱི་བར་དུ་ནས་ཀྱི་འོ་ཐུག་གི་ཟས་ཟོས་ཏེ་གཙང་མ་ཤིན་ཏུ་ཁྲུས་བྱས་པ་གོས་གཙང་མ་བགོས་པས་རིའི་གསེབ་ཏུ་ཞུགས་ལ།
en: If the vidyā holder wants to conjure the Potala palace where Noble Avalokiteśvara resides, he should subsist on food consisting of milk and barley for seven days. He should maintain ritual purity, bathe thoroughly, and wear clean clothes.

source: ས་ཕྱོགས་གཙང་མའི་གནས་དེར་ཤིང་དྲི་ཞིམ་པོའི་མེ་སྦར་བ་ལ་ཡུངས་ཀར་ཕྱེ་མ་དང་བསྲེས་པ་འབྲུ་མར་གྱི་རྒྱལ་པོ་དང་སྦྱར་ལ་འབྲས་སོ་བ་དང་བསྲེས་པ་སྟོང་རྩ་བརྒྱད་ཞག་བདུན་དུ་དུས་གསུམ་དུ་སྦྱིན་སྲེག་བྱའོ།
en: He should go inside a cleft in a mountain, find a clean spot, offer one thousand and eight oblations of mustard seeds mixed with the powder and daubed in the king of oils, and combine them with rice grains. He should do this at the three junctions of the day for seven days, using sticks of fragrant wood for the fire.

source: །ལྷ་བཤོས་དང་གཏོར་མ་དཀར་པོ་འབུལ་ལོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཚེས་བརྒྱད་ལ་ཉིན་ཞག་གཅིག་སྨྱུང་བ་བྱས་ལ་ཤིན་ཏུ་ཁྲུས་བྱས་པ་གཙང་མས་སྤོས་སྣ་ཚོགས་ཀྱིས་ལུས་བསྐུས་གོས་བཟང་པོ་གཙང་མ་བགོས་ཏེ།
en: He should offer a bali consisting of ‘white’ foods and then, on the eighth lunar day, fast all day and all night. He should purify himself ritually, bathe thoroughly, apply a perfume of an exquisite fragrance, and put on impeccably clean garments of fine fabric. “

source: འབྲུ་མར་གྱི་རྒྱལ་པོས་རང་གི་ལུས་བསྐུས་ཕྱེ་མས་ལུས་བྱུགས་མིག་སྨན་གྱིས་མིག་བསྐུས། ཐིག་ལེ་བྱས་ལ་ནོར་བུས་མགོ་བཅིང་ཞིང་མགུལ་པ་དང་། ལག་པ་དང་། དཔུང་པ་དང་།
en: He should thoroughly anoint his body with the king of oils, rub his limbs with the powder, anoint his eyes with the eye ointment, apply the bindi to his forehead, and fasten the amulet onto his head.

source: རྐེད་པར་ཡང་བཅིངས་ལ་ཡུངས་ཀར་དང་མཚལ་བསྲེས་པས་རིའི་ཕྱོགས་བཞིར་གཏོར་བར་བྱ།
en: He should tie the amulet around his neck, wrists, arms, and waist. He should then cast some mustard seeds mixed with vermillion into the four directions, so that the mountain is sprinkled with them.

source: པདྨ་ཆེན་པོའི་ཕྱེ་མ་དེ་ཡང་ཕྱོགས་བཞིར་གཏོར།
en: He should also cast the great powder made from lotuses in the four directions.

source: རང་གི་ལག་པ་གཡོན་པས་ཞགས་པ་དང་། པདྨ་གཟུང་ཞིང་གཡས་པས་རྣམ་པར་ལྟ་བ་སྣང་བ་དང་། དོན་ཡོད་པ་ཆེན་པོས་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་བཟུང་སྟེ།
en: Grasping a lotus and noose with his left hand and forming with his right hand the great amogha mudrā that represents the stainless glow of Avalokiteśvara, he should recite the sūtra of Amoghapāśa one time.

source: དོན་ཡོད་པའི་ཞགས་པའི་མདོ་ལན་ཅིག་བཟླས་བརྗོད་བྱས་ན་ཇི་ལྟར་དོན་ཡོད་པའི་ཞགས་པའི་མདོ་སྡེ་བཤད་པ་ལས་བསྟན་པ་དེ་ལྟར་རི་པོ་ཊ་ལའི་གཞལ་མེད་ཁང་མཐོང་བར་འགྱུར་རོ།
en: Potala Palace will appear on the mountain, just as described in the Amogha­pāśa Sūtra. “

source: །རིག་སྔགས་འཆང་དེ་ཡང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་སུ་སྣང་བར་འགྱུར་རོ། །ཇི་ལྟར་རི་པོ་ཊ་ལའི་གཞལ་མེད་ཁང་བཞིན་དུ་རི་དེ་ལ་ཡང་གཞལ་མེད་ཁང་སྣང་སྟེ།
en: The vidyā holder himself will appear in the form of Noble Avalokiteśvara, and Potala Palace on the mountain will appear exactly as it is on Potala Mountain.

source: རི་དེ་ལ་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་སྣང་ངོ་། །མེ་ཏོག་སྣ་ཚོགས་ཀྱི་གཞལ་མེད་ཁང་སྣང་ངོ་། །སཱ་ལ་དང་། ཏཱ་ལ་དང་། ཏ་མ་ལ་དང་། ཙམ་པ་ཀ་དང་། ཨ་ཤོ་ཀ་དང་། ཨ་དྷི་མུཀྟི་ཀ་དང་། བ་རི་ཤ་ཀ་དང་། ཀ་དམྦ་དང་།
en: The trees that grow on the mountain will appear as if fashioned from various jewels, and gardens will appear with various flowers and trees, such as sal trees, palm trees, tamāla trees, champak trees, aśoka trees, atimuktaka trees, Arabian jasmine, kadamba trees, nīla trees, trumpet-flower trees, flame-of-the-forest trees, cluster-fig trees, and karnikara trees.

source: ནཱི་ལ་དང་། པཱ་ཊ་ལ་དང་། པཱ་ལཱ་ཤ་དང་། ཨུ་དུམ་བཱ་ར་དང་། དོང་ཀཱའི་མེ་ཏོག་སྣ་ཚོགས་དང་། སྣ་མའི་མེ་ཏོག་དང་།
en: Various rest houses will appear that are adorned with cotton rosemallows, jasmine, and kupaka, all graced with various species of birds and made pleasant with the sounds of their chirping.

source: ཏ་ར་ཎ་དང་། ན་བ་མ་ལི་ཀ་དང་། ཀུ་པ་པྱ་ཀ་སྣ་ཚོགས་སྣང་བར་འགྱུར་རོ། །བྱའི་ཚོགས་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་པ་དང་། རི་དགས་ཀྱི་ཚོགས་སྣ་ཚོགས་ཀྱིས་གང་བ་སྣང་བར་འགྱུར་རོ།
en: Flocks of various birds and herds of deer will be seen all around it.

source: །གང་གི་ཚེ་ཕྱིར་བསྡུ་བ་བྱེད་པར་འདོད་པ་དེའི་ཚེ་གནས་གཞན་དུ་འགྲོ་བར་བྱའོ།
en: If the vidyā holder wants to apply a counteragent, he should move to another place.

source: །གཞན་ཡང་དགོས་པ་སྣ་ཚོགས་ལ་རང་གི་བློ་གྲོས་ལ་ཇི་ལྟར་སྣང་བ་བཞིན་བྱའོ།
en: He will be able to display any other feats that he can imagine or that come to his mind.

source: །དགོས་པ་ཐམས་ཅད་ལ་རབ་ཏུ་སྦྱར་བ་ནི་བཀླགས་པ་ཙམ་གྱིས་འགྲུབ་པར་འགྱུར་རོ།
en: All such feats can be accomplished merely by studying about them. “
